Ran Apply for project: `github` dir: `apps/github` workspace: `github`

<details><summary>Show Output</summary>

```diff
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/mvaldes/github/runs/run-sFfzGze9WpfrLd2J

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
data.github_repository.blog: Refreshing...
module.repositories["twitch-bot"].github_repository.repo: Refreshing state... [id=twitch-bot]
module.repositories["meal-notifier"].github_repository.repo: Refreshing state... [id=meal-notifier]
module.repositories["chef"].github_repository.repo: Refreshing state... [id=chef]
module.repositories["gh-actions"].github_repository.repo: Refreshing state... [id=gh-actions]
module.repositories["otel-collector"].github_repository.repo: Refreshing state... [id=otel-collector]
module.repositories["linear.nvim"].github_repository.repo: Refreshing state... [id=linear.nvim]
module.repositories["todoist.nvim"].github_repository.repo: Refreshing state... [id=todoist.nvim]
module.repositories["dotfiles"].github_repository.repo: Refreshing state... [id=dotfiles]
module.repositories["pulumi"].github_repository.repo: Refreshing state... [id=pulumi]
module.repositories["k8s-lsp"].github_repository.repo: Refreshing state... [id=k8s-lsp]
module.repositories["ansible_playbooks"].github_repository.repo: Refreshing state... [id=ansible_playbooks]
module.repositories["k8s-apps"].github_repository.repo: Refreshing state... [id=k8s-apps]
module.repositories["dotfiles-nix"].github_repository.repo: Refreshing state... [id=dotfiles-nix]
data.github_repository.blog: Refresh complete after 2s [id=blog]
module.repositories["ansible_playbooks"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145032]
module.repositories["k8s-lsp"].github_repository_webhook.webhook[0]: Refreshing state... [id=587062198]
module.repositories["dotfiles"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145038]
module.repositories["twitch-bot"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145035]
module.repositories["meal-notifier"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145050]
module.repositories["dotfiles-nix"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145046]
module.repositories["otel-collector"].github_repository_webhook.webhook[0]: Refreshing state... [id=591562235]
module.repositories["todoist.nvim"].github_repository_webhook.webhook[0]: Refreshing state... [id=521309558]
module.repositories["linear.nvim"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145043]
module.repositories["pulumi"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145026]
module.repositories["chef"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145056]
module.repositories["k8s-apps"].github_repository_webhook.webhook[0]: Refreshing state... [id=521145049]
module.repositories["gh-actions"].github_repository_webhook.webhook[0]: Refreshing state... [id=573195043]
module.repositories["twitch-bot"].github_actions_secret.dockerhub_token[0]: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
module.repositories["meal-notifier"].github_actions_secret.dockerhub_token[0]: Refreshing state... [id=meal-notifier:DOCKERHUB_TOKEN]
module.repositories["meal-notifier"].github_actions_secret.dockerhub_username[0]: Refreshing state... [id=meal-notifier:DOCKERHUB_USERNAME]
module.repositories["twitch-bot"].github_actions_secret.dockerhub_username[0]: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
module.repositories["todoist.nvim"].github_repository.repo: Drift detected (update)
module.repositories["pulumi"].github_repository.repo: Drift detected (update)
module.repositories["chef"].github_repository.repo: Drift detected (update)
module.repositories["linear.nvim"].github_repository.repo: Drift detected (update)
module.repositories["meal-notifier"].github_repository.repo: Drift detected (update)
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "telegram_to" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-sFfzGze9WpfrLd2J/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "telegram_token" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-sFfzGze9WpfrLd2J/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repositories["dotfiles-vorpal"].github_repository.repo will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + fork                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "dotfiles-vorpal"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + source_owner                = (known after apply)
      + source_repo                 = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "homelab",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # module.repositories["dotfiles-vorpal"].github_repository_webhook.webhook[0] will be created
  + resource "github_repository_webhook" "webhook" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "*",
        ]
      + id         = (known after apply)
      + repository = "dotfiles-vorpal"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

module.repositories["dotfiles-vorpal"].github_repository.repo: Creating...
module.repositories["dotfiles-vorpal"].github_repository.repo: Still creating... [10s elapsed]
module.repositories["dotfiles-vorpal"].github_repository.repo: Creation complete after 10s [id=dotfiles-vorpal]
module.repositories["dotfiles-vorpal"].github_repository_webhook.webhook[0]: Creating...
module.repositories["dotfiles-vorpal"].github_repository_webhook.webhook[0]: Creation complete after 2s [id=598498004]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "telegram_token" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-sFfzGze9WpfrLd2J/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "telegram_to" but a value
│ was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-sFfzGze9WpfrLd2J/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```

</details>